ammarRajabA/ENC28J60-LAN/CCS_5 C code/TCPIP/PIC18F67K22_registers.broken.h
#byte CCPR1L = 0xFBC

struct CCP1CONBITS {
   unsigned int CCP1M0:1;
   unsigned int CCP1M1:1;
   unsigned int CCP1M2:1;
   unsigned int CCP1M3:1;
   unsigned int DC1B4:1;
   unsigned int DC1B5:1;
   unsigned int P1M6:1;
   unsigned int P1M1:1;
} CCP1CONbits;
#byte CCP1CONbits = 0xFBB
#byte CCP1CON = 0xFBB

struct PIR5BITS {
   unsigned int TMR4IF:1;
   unsigned int TMR5IF:1;
   unsigned int TMR6IF:1;
   unsigned int TMR7IF:1;
   unsigned int TMR8IF:1;
   unsigned int TMR10IF:1;
   unsigned int TMR12IF:1;
   unsigned int TMR7GIF:1;
} PIR5bits;
#byte PIR5bits = 0xFBA
#byte PIR5 = 0xFBA

struct PIE5BITS {
   unsigned int TMR4IE:1;
   unsigned int TMR5IE:1;
   unsigned int TMR6IE:1;
   unsigned int TMR7IE:1;
   unsigned int TMR8IE:1;
   unsigned int TMR10IE:1;
   unsigned int TMR12IE:1;
   unsigned int TMR7GIE:1;
} PIE5bits;
#byte PIE5bits = 0xFB9
#byte PIE5 = 0xFB9

struct IPR4BITS {
   unsigned int CCP3IP:1;
   unsigned int CCP4IP:1;
   unsigned int CCP5IP:1;
   unsigned int CCP6IP:1;
   unsigned int CCP7IP:1;
   unsigned int CCP8IP:1;
   unsigned int CCP9IP:1;
   unsigned int CCP10IP:1;
} IPR4bits;
#byte IPR4bits = 0xFB8
#byte IPR4 = 0xFB8

struct PIR4BITS {
   unsigned int CCP3IF:1;
   unsigned int CCP4IF:1;
   unsigned int CCP5IF:1;
   unsigned int CCP6IF:1;
   unsigned int CCP7IF:1;
   unsigned int CCP8IF:1;
   unsigned int CCP9IF:1;
   unsigned int CCP10IF:1;
} PIR4bits;
#byte PIR4bits = 0xFB7
#byte PIR4 = 0xFB7

struct PIE4BITS {
   unsigned int CCP3IE:1;
   unsigned int CCP4IE:1;
   unsigned int CCP5IE:1;
   unsigned int CCP6IE:1;
   unsigned int CCP7IE:1;
   unsigned int CCP8IE:1;
   unsigned int CCP9IE:1;
   unsigned int CCP10IE:1;
} PIE4bits;
#byte PIE4bits = 0xFB6
#byte PIE4 = 0xFB6

struct CVRCONBITS {
   unsigned int CVR0:1;
   unsigned int CVR1:1;
   unsigned int CVR2:1;
   unsigned int CVR3:1;
   unsigned int CVR4:1;
   unsigned int CVRSS:1;
   unsigned int CVROE:1;
   unsigned int CVREN:1;
} CVRCONbits;
#byte CVRCONbits = 0xFB5
#byte CVRCON = 0xFB5

struct CMSTATBITS {
   unsigned int :5;
   unsigned int CMP1OUT:1;
   unsigned int CMP2OUT:1;
   unsigned int CMP3OUT:1;
} CMSTATbits;
#byte CMSTATbits = 0xFB4
#byte CMSTAT = 0xFB4

#byte TMR3H = 0xFB3

#byte TMR3L = 0xFB2

struct T3CONBITS {
   unsigned int TMR3ON:1;
   unsigned int RD1:1;
   unsigned int T3SYNC:1;
   unsigned int SOSCEN:1;
   unsigned int T3CKPS4:1;
   unsigned int T3CKPS5:1;
   unsigned int TMR3CS6:1;
   unsigned int TMR3CS1:1;
} T3CONbits;
#byte T3CONbits = 0xFB1
#byte T3CON = 0xFB1

struct T3GCONBITS {
   unsigned int T3GSS0:1;
   unsigned int T3GSS1:1;
   unsigned int T3GVAL:1;
   unsigned int T3GGO:1;
   unsigned int T3GSPM:1;
   unsigned int T3GTM:1;
   unsigned int T3GPOL:1;
   unsigned int TMR3GE:1;
} T3GCONbits;
#byte T3GCONbits = 0xFB0
#byte T3GCON = 0xFB0

#byte SPBRG1 = 0xFAF

#byte RCREG1 = 0xFAE

#byte TXREG1 = 0xFAD

struct TXSTA1BITS {
   unsigned int TX9D:1;
   unsigned int TRMT:1;
   unsigned int BRGH:1;
   unsigned int SENDB:1;
   unsigned int SYNC:1;
   unsigned int TXEN:1;
   unsigned int TX:1;
   unsigned int CSRC:1;
} TXSTA1bits;
#byte TXSTA1bits = 0xFAC
#byte TXSTA1 = 0xFAC

struct RCSTA1BITS {
   unsigned int RX9D:1;
   unsigned int OERR:1;
   unsigned int FERR:1;
   unsigned int ADDEN:1;
   unsigned int CREN:1;
   unsigned int SREN:1;
   unsigned int RX:1;
   unsigned int SPEN:1;
} RCSTA1bits;
#byte RCSTA1bits = 0xFAB
#byte RCSTA1 = 0xFAB

struct T1GCONBITS {
   unsigned int T1GSS0:1;
   unsigned int T1GSS1:1;
   unsigned int T1GVAL:1;
   unsigned int T1GGO:1;
   unsigned int T1GSPM:1;
   unsigned int T1GTM:1;
   unsigned int T1GPOL:1;
   unsigned int TMR1GE:1;
} T1GCONbits;
#byte T1GCONbits = 0xFAA
#byte T1GCON = 0xFAA

struct IPR6BITS {
   unsigned int CMP1IP:1;
   unsigned int CMP2IP:1;
   unsigned int CMP3IP:1;
   unsigned int :1;
   unsigned int EEIP:1;
} IPR6bits;
#byte IPR6bits = 0xFA9
#byte IPR6 = 0xFA9

struct HLVDCONBITS {
   unsigned int HLVDL0:1;
   unsigned int HLVDL1:1;
   unsigned int HLVDL2:1;
   unsigned int HLVDL3:1;
   unsigned int HLVDEN:1;
   unsigned int IRVST:1;
   unsigned int BGVST:1;
   unsigned int VDIRMAG:1;
} HLVDCONbits;
#byte HLVDCONbits = 0xFA8
#byte HLVDCON = 0xFA8

struct PSPCONBITS {
   unsigned int :4;
   unsigned int PSPMODE:1;
   unsigned int IBOV:1;
   unsigned int OBF:1;
   unsigned int IBF:1;
} PSPCONbits;
#byte PSPCONbits = 0xFA7
#byte PSPCON = 0xFA7

struct PIR6BITS {
   unsigned int CMP1IF:1;
   unsigned int CMP2IF:1;
   unsigned int CMP3IF:1;
   unsigned int :1;
   unsigned int EEIF:1;
} PIR6bits;
#byte PIR6bits = 0xFA6
#byte PIR6 = 0xFA6

struct IPR3BITS {
   unsigned int RTCCIP:1;
   unsigned int CCP1IP:1;
   unsigned int CCP2IP:1;
   unsigned int CTMUIP:1;
   unsigned int TX2IP:1;
   unsigned int RC2IP:1;
   unsigned int :1;
   unsigned int TMR5GIP:1;
} IPR3bits;
#byte IPR3bits = 0xFA5
#byte IPR3 = 0xFA5

struct PIR3BITS {
   unsigned int RTCCIF:1;
   unsigned int CCP1IF:1;
   unsigned int CCP2IF:1;
   unsigned int CTMUIF:1;
   unsigned int TX2IF:1;
   unsigned int RC2IF:1;
   unsigned int :1;
   unsigned int TMR5GIF:1;
} PIR3bits;
#byte PIR3bits = 0xFA4
#byte PIR3 = 0xFA4

struct PIE3BITS {
   unsigned int RTCCIE:1;
   unsigned int CCP1IE:1;
   unsigned int CCP2IE:1;
   unsigned int CTMUIE:1;
   unsigned int TX2IE:1;
   unsigned int RC2IE:1;
   unsigned int :1;
   unsigned int TMR5GIE:1;
} PIE3bits;
#byte PIE3bits = 0xFA3
#byte PIE3 = 0xFA3

struct IPR2BITS {
   unsigned int TMR3GIP:1;
   unsigned int TMR3IP:1;
   unsigned int HLVDIP:1;
   unsigned int BCL1IP:1;
   unsigned int BCL2IP:1;
   unsigned int SSP2IP:1;
   unsigned int :1;
   unsigned int OSCFIP:1;
} IPR2bits;
#byte IPR2bits = 0xFA2
#byte IPR2 = 0xFA2

struct PIR2BITS {
   unsigned int TMR3GIF:1;
   unsigned int TMR3IF:1;
   unsigned int HLVDIF:1;
   unsigned int BCL1IF:1;
   unsigned int BCL2IF:1;
   unsigned int SSP2IF:1;
   unsigned int :1;
   unsigned int OSCFIF:1;
} PIR2bits;
#byte PIR2bits = 0xFA1
#byte PIR2 = 0xFA1

struct PIE2BITS {
   unsigned int TMR3GIE:1;
   unsigned int TMR3IE:1;
   unsigned int HLVDIE:1;
   unsigned int BCL1IE:1;
   unsigned int BCL2IE:1;
   unsigned int SSP2IE:1;
   unsigned int :1;
   unsigned int OSCFIE:1;
} PIE2bits;
#byte PIE2bits = 0xFA0
#byte PIE2 = 0xFA0

struct IPR1BITS {
   unsigned int TMR1IP:1;
   unsigned int TMR2IP:1;
   unsigned int TMR1GIP:1;
   unsigned int SSP1IP:1;
   unsigned int TX1IP:1;
   unsigned int RC1IP:1;
   unsigned int ADIP:1;
   unsigned int PSPIP:1;
} IPR1bits;
