ammarRajabA/ENC28J60-LAN/CCS_5 C code/TCPIP/PIC18F67K22_registers.broken.h
struct PORTDBITS {
   unsigned int RD0:1;
   unsigned int RD1:1;
   unsigned int RD2:1;
   unsigned int RD3:1;
   unsigned int RD4:1;
   unsigned int RD5:1;
   unsigned int RD6:1;
   unsigned int RD7:1;
} PORTDbits;
#byte PORTD = 0xF83
#byte PORTD = 0xF83

struct PORTCBITS {
   unsigned int RC0:1;
   unsigned int RC1:1;
   unsigned int RC2:1;
   unsigned int RC3:1;
   unsigned int RC4:1;
   unsigned int RC5:1;
   unsigned int RC6:1;
   unsigned int RC7:1;
} PORTCbits;
#byte PORTC = 0xF82
#byte PORTC = 0xF82

struct PORTBBITS {
   unsigned int RB0:1;
   unsigned int RB1:1;
   unsigned int RB2:1;
   unsigned int RB3:1;
   unsigned int RB4:1;
   unsigned int RB5:1;
   unsigned int RB6:1;
   unsigned int RB7:1;
} PORTBbits;
#byte PORTB = 0xF81
#byte PORTB = 0xF81

struct PORTABITS {
   unsigned int RA0:1;
   unsigned int RA1:1;
   unsigned int RA2:1;
   unsigned int RA3:1;
   unsigned int RA4:1;
   unsigned int RA5:1;
   unsigned int RA6:1;
   unsigned int RA7:1;
} PORTAbits;
#byte PORTA = 0xF80
#byte PORTA = 0xF80

struct EECON1BITS {
   unsigned int RD:1;
   unsigned int WR:1;
   unsigned int WREN:1;
   unsigned int WRERR:1;
   unsigned int FREE:1;
   unsigned int :1;
   unsigned int CFGS:1;
   unsigned int EEPGD:1;
} EECON1bits;
#byte EECON1bits = 0xF7F
#byte EECON1 = 0xF7F

#byte EECON2 = 0xF7E

#byte TMR5H = 0xF7D

#byte TMR5L = 0xF7C

struct T5CONBITS {
   unsigned int TMR5ON:1;
   unsigned int RD1:1;
   unsigned int T5SYNC:1;
   unsigned int SOSCEN:1;
   unsigned int T5CKPS4:1;
   unsigned int T5CKPS5:1;
   unsigned int TMR5CS6:1;
   unsigned int TMR5CS1:1;
} T5CONbits;
#byte T5CONbits = 0xF7B
#byte T5CON = 0xF7B

struct T5GCONBITS {
   unsigned int T5GSS0:1;
   unsigned int T5GSS1:1;
   unsigned int T5GVAL:1;
   unsigned int T5GGO:1;
   unsigned int T5GSPM:1;
   unsigned int T5GTM:1;
   unsigned int T5GPOL:1;
   unsigned int TMR5GE:1;
} T5GCONbits;
#byte T5GCONbits = 0xF7A
#byte T5GCON = 0xF7A

#byte CCPR4H = 0xF79

#byte CCPR4L = 0xF78

struct CCP4CONBITS {
   unsigned int CCP4M0:1;
   unsigned int CCP4M1:1;
   unsigned int CCP4M2:1;
   unsigned int CCP4M3:1;
   unsigned int DC4B4:1;
   unsigned int DC4B1:1;
} CCP4CONbits;
#byte CCP4CONbits = 0xF77
#byte CCP4CON = 0xF77

#byte CCPR5H = 0xF76

#byte CCPR5L = 0xF75

struct CCP5CONBITS {
   unsigned int CCP5M0:1;
   unsigned int CCP5M1:1;
   unsigned int CCP5M2:1;
   unsigned int CCP5M3:1;
   unsigned int DC5B4:1;
   unsigned int DC5B1:1;
} CCP5CONbits;
#byte CCP5CONbits = 0xF74
#byte CCP5CON = 0xF74

#byte CCPR6H = 0xF73

#byte CCPR6L = 0xF72

struct CCP6CONBITS {
   unsigned int CCP6M0:1;
   unsigned int CCP6M1:1;
   unsigned int CCP6M2:1;
   unsigned int CCP6M3:1;
   unsigned int DC6B4:1;
   unsigned int DC6B1:1;
} CCP6CONbits;
#byte CCP6CONbits = 0xF71
#byte CCP6CON = 0xF71

#byte CCPR7H = 0xF70

#byte CCPR7L = 0xF6F

struct CCP7CONBITS {
   unsigned int CCP7M0:1;
   unsigned int CCP7M1:1;
   unsigned int CCP7M2:1;
   unsigned int CCP7M3:1;
   unsigned int DC7B4:1;
   unsigned int DC7B1:1;
} CCP7CONbits;
#byte CCP7CONbits = 0xF6E
#byte CCP7CON = 0xF6E

#byte TMR4 = 0xF6D

#byte PR4 = 0xF6C

struct T4CONBITS {
   unsigned int T4CKPS0:1;
   unsigned int T4CKPS1:1;
   unsigned int TMR4ON:1;
   unsigned int T4OUTPS3:1;
   unsigned int T4OUTPS4:1;
   unsigned int T4OUTPS5:1;
   unsigned int T4OUTPS3:1;
} T4CONbits;
#byte T4CONbits = 0xF6B
#byte T4CON = 0xF6B

#byte SSP2BUF = 0xF6A

#byte SSP2MSK = 0xF69

#byte SSP2ADD = 0xF69

struct SSP2STATBITS {
   unsigned int BF:1;
   unsigned int UA:1;
   unsigned int R:1;
   unsigned int S:1;
   unsigned int P:1;
   unsigned int D:1;
   unsigned int CKE:1;
   unsigned int SMP:1;
} SSP2STATbits;
#byte SSP2STATbits = 0xF68
#byte SSP2STAT = 0xF68

struct SSP2CON1BITS {
   unsigned int SSPM0:1;
   unsigned int SSPM1:1;
   unsigned int SSPM2:1;
   unsigned int SSPM3:1;
   unsigned int CKP:1;
   unsigned int SSPEN:1;
   unsigned int SSPOV:1;
   unsigned int WCOL:1;
} SSP2CON1bits;
#byte SSP2CON1bits = 0xF67
#byte SSP2CON1 = 0xF67

struct SSP2CON2BITS {
   unsigned int SEN:1;
   unsigned int RSEN:1;
   unsigned int PEN:1;
   unsigned int RCEN:1;
   unsigned int ACKEN:1;
   unsigned int ACKDT:1;
   unsigned int ACKSTAT:1;
   unsigned int GCEN:1;
} SSP2CON2bits;
#byte SSP2CON2bits = 0xF66
#byte SSP2CON2 = 0xF66

struct BAUDCON1BITS {
   unsigned int ABDEN:1;
   unsigned int WUE:1;
   unsigned int :1;
   unsigned int BRG1:1;
   unsigned int TXCKP:1;
   unsigned int RXDTP:1;
   unsigned int RCMT:1;
   unsigned int ABDOVF:1;
} BAUDCON1bits;
#byte BAUDCON1bits = 0xF65
#byte BAUDCON1 = 0xF65

struct OSCCON2BITS {
   unsigned int MFIOSEL:1;
   unsigned int MFIOFS:1;
   unsigned int :1;
   unsigned int SOSCGO:1;
   unsigned int :2;
   unsigned int SOSCRUN:1;
} OSCCON2bits;
#byte OSCCON2bits = 0xF64
#byte OSCCON2 = 0xF64

#byte EEADRH = 0xF63

#byte EEADR = 0xF62

#byte EEDATA = 0xF61

struct PIE6BITS {
   unsigned int CMP1IE:1;
   unsigned int CMP2IE:1;
   unsigned int CMP3IE:1;
   unsigned int :1;
   unsigned int EEIE:1;
} PIE6bits;
#byte PIE6bits = 0xF60
#byte PIE6 = 0xF60

struct RTCCFGBITS {
   unsigned int RTCPTR0:1;
   unsigned int RTCPTR1:1;
   unsigned int RTCOE:1;
   unsigned int HALFSEC:1;
   unsigned int RTCSYNC:1;
   unsigned int RTCWREN:1;
   unsigned int :1;
   unsigned int RTCEN:1;
} RTCCFGbits;
#byte RTCCFGbits = 0xF5F
#byte RTCCFG = 0xF5F

#byte RTCCAL = 0xF5E

#byte RTCVALH = 0xF5D

#byte RTCVALL = 0xF5C

struct ALRMCFGBITS {
   unsigned int ALRMPTR0:1;
   unsigned int ALRMPTR1:1;
   unsigned int AMASK2:1;
   unsigned int AMASK3:1;
   unsigned int AMASK4:1;
   unsigned int AMASK5:1;
   unsigned int CHIME:1;
   unsigned int ALRMEN:1;
} ALRMCFGbits;
#byte ALRMCFGbits = 0xF5B
#byte ALRMCFG = 0xF5B

#byte ALRMRPT = 0xF5A

