ammarRajabA/ENC28J60-LAN/CCS_5 C code/TCPIP/PIC18F67K22_registers.broken.h
#byte ALRMVALH = 0xF59

#byte ALRMVALL = 0xF58

struct CTMUCONHBITS {
   unsigned int CTTRIG:1;
   unsigned int IDISSEN:1;
   unsigned int EDGSEQEN:1;
   unsigned int EDGEN:1;
   unsigned int TGEN:1;
   unsigned int CTMUSIDL:1;
   unsigned int :1;
   unsigned int CTMUEN:1;
} CTMUCONHbits;
#byte CTMUCONHbits = 0xF57
#byte CTMUCONH = 0xF57

struct CTMUCONLBITS {
   unsigned int EDG1STAT:1;
   unsigned int EDG2STAT:1;
   unsigned int EDG1SEL2:1;
   unsigned int EDG1SEL3:1;
   unsigned int EDG1POL:1;
   unsigned int EDG2SEL5:1;
   unsigned int EDG2SEL6:1;
   unsigned int EDG2POL:1;
} CTMUCONLbits;
#byte CTMUCONLbits = 0xF56
#byte CTMUCONL = 0xF56

struct CTMUICONBITS {
   unsigned int IRNG0:1;
   unsigned int IRNG1:1;
   unsigned int ITRIM2:1;
   unsigned int ITRIM3:1;
   unsigned int ITRIM4:1;
   unsigned int ITRIM5:1;
   unsigned int ITRIM6:1;
   unsigned int ITRIM5:1;
} CTMUICONbits;
#byte CTMUICONbits = 0xF55
#byte CTMUICON = 0xF55

struct CM1CONBITS {
   unsigned int CCH0:1;
   unsigned int CCH1:1;
   unsigned int CREF:1;
   unsigned int EVPOL3:1;
   unsigned int EVPOL4:1;
   unsigned int CPOL:1;
   unsigned int COE:1;
   unsigned int CON:1;
} CM1CONbits;
#byte CM1CONbits = 0xF54
#byte CM1CON = 0xF54

struct PADCFG1BITS {
   unsigned int :1;
   unsigned int RTSECSEL1:1;
   unsigned int RTSECSEL1:1;
   unsigned int :3;
   unsigned int REPU:1;
   unsigned int RDPU:1;
} PADCFG1bits;
#byte PADCFG1bits = 0xF53
#byte PADCFG1 = 0xF53

struct ECCP2ASBITS {
   unsigned int PSS2BD0:1;
   unsigned int PSS2BD1:1;
   unsigned int PSS2AC2:1;
   unsigned int PSS2AC3:1;
   unsigned int ECCP2AS4:1;
   unsigned int ECCP2AS5:1;
   unsigned int ECCP2AS6:1;
   unsigned int ECCP2ASE:1;
} ECCP2ASbits;
#byte ECCP2ASbits = 0xF52
#byte ECCP2AS = 0xF52

struct ECCP2DELBITS {
   unsigned int P2DC0:1;
   unsigned int P2DC1:1;
   unsigned int P2DC2:1;
   unsigned int P2DC3:1;
   unsigned int P2DC4:1;
   unsigned int P2DC5:1;
   unsigned int P2DC6:1;
   unsigned int P2RSEN:1;
} ECCP2DELbits;
#byte ECCP2DELbits = 0xF51
#byte ECCP2DEL = 0xF51

#byte CCPR2H = 0xF50

#byte CCPR2L = 0xF4F

struct CCP2CONBITS {
   unsigned int CCP2M0:1;
   unsigned int CCP2M1:1;
   unsigned int CCP2M2:1;
   unsigned int CCP2M3:1;
   unsigned int DC2B4:1;
   unsigned int DC2B5:1;
   unsigned int P2M6:1;
   unsigned int P2M1:1;
} CCP2CONbits;
#byte CCP2CONbits = 0xF4E
#byte CCP2CON = 0xF4E

struct ECCP3ASBITS {
   unsigned int PSS3BD0:1;
   unsigned int PSS3BD1:1;
   unsigned int PSS3AC2:1;
   unsigned int PSS3AC3:1;
   unsigned int ECCP3AS4:1;
   unsigned int ECCP3AS5:1;
   unsigned int ECCP3AS6:1;
   unsigned int ECCP3ASE:1;
} ECCP3ASbits;
#byte ECCP3ASbits = 0xF4D
#byte ECCP3AS = 0xF4D

struct ECCP3DELBITS {
   unsigned int P3DC0:1;
   unsigned int P3DC1:1;
   unsigned int P3DC2:1;
   unsigned int P3DC3:1;
   unsigned int P3DC4:1;
   unsigned int P3DC5:1;
   unsigned int P3DC6:1;
   unsigned int P3RSEN:1;
} ECCP3DELbits;
#byte ECCP3DELbits = 0xF4C
#byte ECCP3DEL = 0xF4C

#byte CCPR3H = 0xF4B

#byte CCPR3L = 0xF4A

struct CCP3CONBITS {
   unsigned int CCP3M0:1;
   unsigned int CCP3M1:1;
   unsigned int CCP3M2:1;
   unsigned int CCP3M3:1;
   unsigned int DC3B4:1;
   unsigned int DC3B5:1;
   unsigned int P3M6:1;
   unsigned int P3M1:1;
} CCP3CONbits;
#byte CCP3CONbits = 0xF49
#byte CCP3CON = 0xF49

#byte CCPR8H = 0xF48

#byte CCPR8L = 0xF47

struct CCP8CONBITS {
   unsigned int CCP8M0:1;
   unsigned int CCP8M1:1;
   unsigned int CCP8M2:1;
   unsigned int CCP8M3:1;
   unsigned int DC8B4:1;
   unsigned int DC8B1:1;
} CCP8CONbits;
#byte CCP8CONbits = 0xF46
#byte CCP8CON = 0xF46

#byte CCPR9H = 0xF45

#byte CCPR9L = 0xF44

struct CCP9CONBITS {
   unsigned int CCP9M0:1;
   unsigned int CCP9M1:1;
   unsigned int CCP9M2:1;
   unsigned int CCP9M3:1;
   unsigned int DC9B4:1;
   unsigned int DC9B1:1;
} CCP9CONbits;
#byte CCP9CONbits = 0xF43
#byte CCP9CON = 0xF43

#byte CCPR10H = 0xF42

#byte CCPR10L = 0xF41

struct CCP10CONBITS {
   unsigned int CCP10M0:1;
   unsigned int CCP10M1:1;
   unsigned int CCP10M2:1;
   unsigned int CCP10M3:1;
   unsigned int DC10B4:1;
   unsigned int DC10B1:1;
} CCP10CONbits;
#byte CCP10CONbits = 0xF40
#byte CCP10CON = 0xF40

#byte TMR7H = 0xF3F

#byte TMR7L = 0xF3E

struct T7CONBITS {
   unsigned int TMR7ON:1;
   unsigned int RD1:1;
   unsigned int T7SYNC:1;
   unsigned int SOSCEN:1;
   unsigned int T7CKPS4:1;
   unsigned int T7CKPS5:1;
   unsigned int TMR7CS6:1;
   unsigned int TMR7CS1:1;
} T7CONbits;
#byte T7CONbits = 0xF3D
#byte T7CON = 0xF3D

struct T7GCONBITS {
   unsigned int T7GSS0:1;
   unsigned int T7GSS1:1;
   unsigned int T7GVAL:1;
   unsigned int T7GGO:1;
   unsigned int T7GSPM:1;
   unsigned int T7GTM:1;
   unsigned int T7GPOL:1;
   unsigned int TMR7GE:1;
} T7GCONbits;
#byte T7GCONbits = 0xF3C
#byte T7GCON = 0xF3C

#byte TMR6 = 0xF3B

#byte PR6 = 0xF3A

struct T6CONBITS {
   unsigned int T6CKPS0:1;
   unsigned int T6CKPS1:1;
   unsigned int TMR6ON:1;
   unsigned int T6OUTPS3:1;
   unsigned int T6OUTPS4:1;
   unsigned int T6OUTPS5:1;
   unsigned int T6OUTPS3:1;
} T6CONbits;
#byte T6CONbits = 0xF39
#byte T6CON = 0xF39

#byte TMR8 = 0xF38

#byte PR8 = 0xF37

struct T8CONBITS {
   unsigned int T8CKPS0:1;
   unsigned int T8CKPS1:1;
   unsigned int TMR8ON:1;
   unsigned int T8OUTPS3:1;
   unsigned int T8OUTPS4:1;
   unsigned int T8OUTPS5:1;
   unsigned int T8OUTPS3:1;
} T8CONbits;
#byte T8CONbits = 0xF36
#byte T8CON = 0xF36

#byte TMR10 = 0xF35

#byte PR10 = 0xF34

struct T10CONBITS {
   unsigned int T10CKPS0:1;
   unsigned int T10CKPS1:1;
   unsigned int TMR10ON:1;
   unsigned int T10OUTPS3:1;
   unsigned int T10OUTPS4:1;
   unsigned int T10OUTPS5:1;
   unsigned int T10OUTPS3:1;
} T10CONbits;
#byte T10CONbits = 0xF33
#byte T10CON = 0xF33

#byte TMR12 = 0xF32

#byte PR12 = 0xF31

