ammarRajabA/ENC28J60-LAN/CCS_5 C code/TCPIP/PIC18F67K22_registers.broken.h
struct T12CONBITS {
   unsigned int T12CKPS0:1;
   unsigned int T12CKPS1:1;
   unsigned int TMR12ON:1;
   unsigned int T12OUTPS3:1;
   unsigned int T12OUTPS4:1;
   unsigned int T12OUTPS5:1;
   unsigned int T12OUTPS3:1;
} T12CONbits;
#byte T12CONbits = 0xF30
#byte T12CON = 0xF30

struct CM2CONBITS {
   unsigned int CCH0:1;
   unsigned int CCH1:1;
   unsigned int CREF:1;
   unsigned int EVPOL3:1;
   unsigned int EVPOL4:1;
   unsigned int CPOL:1;
   unsigned int COE:1;
   unsigned int CON:1;
} CM2CONbits;
#byte CM2CONbits = 0xF2F
#byte CM2CON = 0xF2F

struct CM3CONBITS {
   unsigned int CCH0:1;
   unsigned int CCH1:1;
   unsigned int CREF:1;
   unsigned int EVPOL3:1;
   unsigned int EVPOL4:1;
   unsigned int CPOL:1;
   unsigned int COE:1;
   unsigned int CON:1;
} CM3CONbits;
#byte CM3CONbits = 0xF2E
#byte CM3CON = 0xF2E

struct CCPTMRS0BITS {
   unsigned int C1TSEL0:1;
   unsigned int C1TSEL1:1;
   unsigned int C1TSEL2:1;
   unsigned int C2TSEL3:1;
   unsigned int C2TSEL4:1;
   unsigned int C2TSEL5:1;
   unsigned int C3TSEL6:1;
   unsigned int C3TSEL1:1;
} CCPTMRS0bits;
#byte CCPTMRS0bits = 0xF2D
#byte CCPTMRS0 = 0xF2D

struct CCPTMRS1BITS {
   unsigned int C4TSEL0:1;
   unsigned int C4TSEL1:1;
   unsigned int C5TSEL0:1;
   unsigned int :1;
   unsigned int C6TSEL0:1;
   unsigned int :1;
   unsigned int C7TSEL6:1;
   unsigned int C7TSEL1:1;
} CCPTMRS1bits;
#byte CCPTMRS1bits = 0xF2C
#byte CCPTMRS1 = 0xF2C

struct CCPTMRS2BITS {
   unsigned int C8TSEL0:1;
   unsigned int C8TSEL1:1;
   unsigned int C9TSEL0:1;
   unsigned int :1;
   unsigned int C10TSEL0:1;
} CCPTMRS2bits;
#byte CCPTMRS2bits = 0xF2B
#byte CCPTMRS2 = 0xF2B

struct REFOCONBITS {
   unsigned int RODIV0:1;
   unsigned int RODIV1:1;
   unsigned int RODIV2:1;
   unsigned int RODIV3:1;
   unsigned int ROSEL:1;
   unsigned int ROSSLP:1;
   unsigned int :1;
   unsigned int ROON:1;
} REFOCONbits;
#byte REFOCONbits = 0xF2A
#byte REFOCON = 0xF2A

struct ODCON1BITS {
   unsigned int SPI2OD:1;
   unsigned int :4;
   unsigned int CCP1OD:1;
   unsigned int CCP2OD:1;
   unsigned int SPI1OD:1;
} ODCON1bits;
#byte ODCON1bits = 0xF29
#byte ODCON1 = 0xF29

struct ODCON2BITS {
   unsigned int CCP3OD:1;
   unsigned int CCP4OD:1;
   unsigned int CCP5OD:1;
   unsigned int CCP6OD:1;
   unsigned int CCP7OD:1;
   unsigned int CCP8OD:1;
   unsigned int CCP9OD:1;
   unsigned int CCP10OD:1;
} ODCON2bits;
#byte ODCON2bits = 0xF28
#byte ODCON2 = 0xF28

struct ODCON3BITS {
   unsigned int CTMUDS:1;
   unsigned int :5;
   unsigned int U1OD:1;
   unsigned int U2OD:1;
} ODCON3bits;
#byte ODCON3bits = 0xF27
#byte ODCON3 = 0xF27

#byte ANCON0 = 0xF25

struct ANCON1BITS {
   unsigned int ANSEL0:1;
   unsigned int ANSEL1:1;
   unsigned int ANSEL1:2;
} ANCON1bits;
#byte ANCON1bits = 0xF24
#byte ANCON1 = 0xF24

struct ANCON2BITS {
   unsigned int ANSEL1:4;
} ANCON2bits;
#byte ANCON2bits = 0xF23
#byte ANCON2 = 0xF23

struct RCSTA2BITS {
   unsigned int RX9D:1;
   unsigned int OERR:1;
   unsigned int FERR:1;
   unsigned int ADDEN:1;
   unsigned int CREN:1;
   unsigned int SREN:1;
   unsigned int RX:1;
   unsigned int SPEN:1;
} RCSTA2bits;
#byte RCSTA2bits = 0xF22
#byte RCSTA2 = 0xF22

struct TXSTA2BITS {
   unsigned int TX9D:1;
   unsigned int TRMT:1;
   unsigned int BRGH:1;
   unsigned int SENDB:1;
   unsigned int SYNC:1;
   unsigned int TXEN:1;
   unsigned int TX:1;
   unsigned int CSRC:1;
} TXSTA2bits;
#byte TXSTA2bits = 0xF21
#byte TXSTA2 = 0xF21

struct BAUDCON2BITS {
   unsigned int ABDEN:1;
   unsigned int WUE:1;
   unsigned int :1;
   unsigned int BRG1:1;
   unsigned int TXCKP:1;
   unsigned int RXDTP:1;
   unsigned int RCIDL:1;
   unsigned int ABDOVF:1;
} BAUDCON2bits;
#byte BAUDCON2bits = 0xF20
#byte BAUDCON2 = 0xF20

#byte SPBRGH2 = 0xF1F

#byte SPBRG2 = 0xF1E

#byte RCREG2 = 0xF1D

#byte TXREG2 = 0xF1C

struct PSTR2CONBITS {
   unsigned int STRA:1;
   unsigned int STRB:1;
   unsigned int STRC:1;
   unsigned int STRD:1;
   unsigned int STRSYNC:1;
   unsigned int :1;
   unsigned int CMPL6:1;
   unsigned int CMPL1:1;
} PSTR2CONbits;
#byte PSTR2CONbits = 0xF1B
#byte PSTR2CON = 0xF1B

struct PSTR3CONBITS {
   unsigned int STRA:1;
   unsigned int STRB:1;
   unsigned int STRC:1;
   unsigned int STRD:1;
   unsigned int STRSYNC:1;
   unsigned int :1;
   unsigned int CMPL6:1;
   unsigned int CMPL1:1;
} PSTR3CONbits;
#byte PSTR3CONbits = 0xF1A
#byte PSTR3CON = 0xF1A

struct PMD0BITS {
   unsigned int ADCMD:1;
   unsigned int SSP1MD:1;
   unsigned int SSP2MD:1;
   unsigned int UART1MD:1;
   unsigned int UART2MD:1;
   unsigned int CCP1MD:1;
   unsigned int CCP2MD:1;
   unsigned int CCP3MD:1;
} PMD0bits;
#byte PMD0bits = 0xF19
#byte PMD0 = 0xF19

struct PMD1BITS {
   unsigned int EMBMD:1;
   unsigned int TMR1MD:1;
   unsigned int TMR2MD:1;
   unsigned int TMR3MD:1;
   unsigned int TMR4MD:1;
   unsigned int RTCCMD:1;
   unsigned int CTMUMD:1;
   unsigned int PSPMD:1;
} PMD1bits;
#byte PMD1bits = 0xF18
#byte PMD1 = 0xF18

struct PMD2BITS {
   unsigned int CMP1MD:1;
   unsigned int CMP2MD:1;
   unsigned int CMP3MD:1;
   unsigned int TMR5MD:1;
   unsigned int TMR6MD:1;
   unsigned int TMR7MD:1;
   unsigned int TMR8MD:1;
   unsigned int TMR10MD:1;
} PMD2bits;
#byte PMD2bits = 0xF17
#byte PMD2 = 0xF17

struct PMD3BITS {
   unsigned int TMR12MD:1;
   unsigned int CCP4MD:1;
   unsigned int CCP5MD:1;
   unsigned int CCP6MD:1;
   unsigned int CCP7MD:1;
   unsigned int CCP8MD:1;
   unsigned int CCP9MD:1;
   unsigned int CCP10MD:1;
} PMD3bits;
#byte PMD3bits = 0xF16
#byte PMD3 = 0xF16

